# CannotComputeRailElevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotComputeRailElevation Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't compute elevation profile for one or more Rails
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotComputeRailElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotComputeRailElevation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotComputeRailElevation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace